In [1]:
import pandas as pd
import numpy as np

In [9]:
labels = ["a", "b", "c"]
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {"a":10, "b":20, "c":30}

In [4]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [12]:
pd.Series(data=[sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [13]:
ser1 = pd.Series([1, 2, 3, 4], ["USA", "Germany", "USSR", "Japan"])

In [14]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [15]:
ser2 = pd.Series([1,2,5,4], ["USA", "Germany", "Italy", "Japan"])

In [16]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [17]:
ser1["USA"]

1

In [18]:
ser3 = pd.Series(data=labels)

In [19]:
ser3

0    a
1    b
2    c
dtype: object

In [20]:
ser2[0]

1

In [21]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [2]:
from numpy.random import randn

In [23]:
np.random.seed(101)

In [24]:
df = pd.DataFrame(randn(5,4), ["A", "B", "C", "D", "E"], ["W", "X", "Y", "Z"])

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [27]:
type(df["W"])

pandas.core.series.Series

In [28]:
df[["W", "Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [29]:
df["New"] = df["W"] + df["Y"]

In [30]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [33]:
df.drop("New", axis="columns", inplace=True)

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df.drop("E")

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [36]:
df.shape

(5, 4)

In [40]:
df.loc["A"]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [41]:
df.iloc[1]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [42]:
df.loc["B","Y"]

-0.8480769834036315

In [43]:
df.loc[["A", "B"],["W", "Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [45]:
booldf = df > 0

In [46]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [48]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df["W"] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [53]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [54]:
df[df["W"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df[df["Z"]<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [57]:
resultdf = df[df["W"]>0]

In [58]:
resultdf["X"]

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [61]:
df[df["W"]>0][["Y","X"]]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [62]:
boolser = df["W"]>0

In [63]:
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [68]:
result = df[boolser]
my_cols = ["Y", "X"]
result[my_cols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [71]:
df[(df["W"]>0) & (df["Y"]>1)] # use &, or pandas get confused

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [74]:
df[(df["W"]>0) | (df["Y"]>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [76]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [77]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [81]:
newind = "CA NY WY OR CO".split()

In [83]:
df["States"] = newind
df.pop("Satates")
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [84]:
df.set_index("States")

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [4]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [5]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [6]:
df = pd.DataFrame(randn(6,2), hier_index, ["A", "B"])

In [7]:
df

             A         B
G1 1 -0.525610 -0.508289
   2 -1.270465 -1.174539
   3  0.023966  0.080869
G2 1 -0.859357  0.583511
   2 -0.282832 -0.616783
   3 -0.025066  0.733783

In [9]:
df.loc["G1"].loc[1]

A   -0.525610
B   -0.508289
Name: 1, dtype: float64

In [11]:
df.index.names = ["Groups", "Num"]

In [12]:
df

                   A         B
Groups Num
G1     1   -0.525610 -0.508289
       2   -1.270465 -1.174539
       3    0.023966  0.080869
G2     1   -0.859357  0.583511
       2   -0.282832 -0.616783
       3   -0.025066  0.733783

In [13]:
df.loc["G2"].loc[2]["B"]

-0.6167830894596866

In [14]:
df.loc["G1"].loc[3]["A"]

0.02396644656182984

In [15]:
df.xs("G1")

            A         B
Num
1   -0.525610 -0.508289
2   -1.270465 -1.174539
3    0.023966  0.080869

In [19]:
df.xs(1, level="Num")

               A         B
Groups
G1     -0.525610 -0.508289
G2     -0.859357  0.583511

In [21]:
d = {"A":[1,2,np.nan], "B":[5, np.nan, np.nan], "C":[1,2,3]}

In [22]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [26]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [27]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [28]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [29]:
df.fillna(value="Fill")

      A     B  C
0     1     5  1
1     2  Fill  2
2  Fill  Fill  3

In [30]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [31]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [32]:
df = pd.DataFrame(data)

In [33]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [37]:
by_comp = df.groupby("Company")

In [38]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [39]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [40]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [41]:
by_comp.sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

In [43]:
df.groupby("Company").sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

In [44]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [45]:
df.groupby("Company").max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [46]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [47]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [51]:
df["col2"].unique()

array([444, 555, 666])

In [52]:
df["col2"].nunique()

3

In [53]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [55]:
df[(df["col1"]>2) & (df["col2"]==444)]

   col1  col2 col3
3     4   444  xyz

In [57]:
df["col1"].apply(lambda x: x * 2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [58]:
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [59]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [60]:
df.drop("col1", axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [61]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [62]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [63]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [65]:
df.sort_values(by="col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [66]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [67]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [68]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [69]:
df.pivot_table(values="D", index=["A","B"], columns="C")

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [2]:
pwd

'/Users/ninja/Dev/ML'

In [3]:
pd.read_csv("example-Copy1")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
df = pd.read_csv("example-Copy1")

In [5]:
df.to_csv("MY_output", index=False)

In [6]:
pd.read_csv("MY_output")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
pd.read_excel("Excel_Sample-Copy1.xlsx", sheet_name="Sheet1")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
df.to_excel("Excell_sample2.xlsx", sheet_name="NewSheey")

In [9]:
data = pd.read_html("https://www.fdic.gov/bank/individual/failed/banklist.html")

In [10]:
type(data)

list

In [12]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

In [13]:
from sqlalchemy import create_engine

In [14]:
engine = create_engine("sqlite:///:memory:")

In [15]:
df.to_sql("my_table", engine)

In [16]:
sqldf = pd.read_sql("my_table", con=engine)

In [17]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15